Revit 2021.1 API
ShapeImporter.SetDefaultLengthUnit Method
 Sets the length unit to be used if not specified in the input SAT file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2017_subscription_update
Syntax
C#
public void SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
Visual Basic
Public Sub SetDefaultLengthUnit ( _
	defaultLengthUnit As ImportUnit _
)
Visual C++
public:
void SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
Parameters
defaultLengthUnit
Type: Autodesk.Revit.DB.ImportUnit
 The length unit to be used if not specified in the input SAT file.
Remarks
 Values ImportUnit::Default and ImportUnit::Custom are ignored. ImportUnit::Centimeter is used instead.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace